STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U575I-EV/stm32u575i_eval_lcd.c
/** @defgroup STM32U575I_EVAL_LCD_Private_Functions LCD Private Functions
  * @{
  */
/**
  * @brief  Probe the HX8347I LCD driver.
  * @param  Orientation LCD_ORIENTATION_PORTRAIT or LCD_ORIENTATION_LANDSCAPE.
  * @retval BSP status.
  */
static int32_t HX8347I_Probe(uint32_t Orientation)
{
  int32_t                  status;
  HX8347I_IO_t             IOCtx;
  uint32_t                 hx8347i_id;
  static HX8347I_Object_t  HX8347IObj;
  uint32_t                 lcd_orientation;

  /* Configure the LCD driver */
  IOCtx.Address     = LCD_FMC_ADDRESS;
  IOCtx.Init        = LCD_FMC_Init;
  IOCtx.DeInit      = LCD_FMC_DeInit;
  IOCtx.ReadReg     = LCD_FMC_ReadReg16;
  IOCtx.WriteReg    = LCD_FMC_WriteReg16;
  IOCtx.GetTick     = LCD_FMC_GetTick;

  if (HX8347I_RegisterBusIO(&HX8347IObj, &IOCtx) != HX8347I_OK)
  {
    status = BSP_ERROR_BUS_FAILURE;
  }
  else if (HX8347I_ReadID(&HX8347IObj, &hx8347i_id) != HX8347I_OK)
  {
    status = BSP_ERROR_COMPONENT_FAILURE;
  }
  else if (hx8347i_id != HX8347I_ID)
  {
    status = BSP_ERROR_UNKNOWN_COMPONENT;
  }
  else
  {
    Lcd_CompObj[0] = &HX8347IObj;
    Lcd_Drv[0] = (LCD_Drv_t *) &HX8347I_Driver;
    if (Orientation == LCD_ORIENTATION_PORTRAIT)
    {
      lcd_orientation = HX8347I_ORIENTATION_PORTRAIT;
    }
    else if (Orientation == LCD_ORIENTATION_LANDSCAPE)
    {
      lcd_orientation = HX8347I_ORIENTATION_LANDSCAPE;
    }
    else if (Orientation == LCD_ORIENTATION_PORTRAIT_ROT180)
    {
      lcd_orientation = HX8347I_ORIENTATION_PORTRAIT_ROT180;
    }
    else
    {
      lcd_orientation = HX8347I_ORIENTATION_LANDSCAPE_ROT180;
    }
    if (Lcd_Drv[0]->Init(Lcd_CompObj[0], HX8347I_FORMAT_RBG565, lcd_orientation) < 0)
    {
      status = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      status = BSP_ERROR_NONE;
    }
  }

  return status;
}

/**
  * @brief  Un-reset HX8347I and activate backlight.
  * @retval BSP status.
  */
static int32_t HX8347I_PowerUp(void)
{
  int32_t status;

#if (USE_BSP_IO_CLASS > 0)
  BSP_IO_Init_t    IO_Init;
  GPIO_InitTypeDef GPIO_InitStruct;

  /* Initialize the BSP IO driver and configure the HX8347I reset pin */
  IO_Init.Pin  = IO_PIN_12;
  IO_Init.Mode = IO_MODE_OUTPUT_OD;
  IO_Init.Pull = IO_NOPULL;
  status = BSP_IO_Init(0, &IO_Init);
  if (status == BSP_ERROR_NONE)
  {
    /* Un-reset the HX8347I */
    status = BSP_IO_WritePin(0, IO_PIN_12, IO_PIN_SET);
    if (status == BSP_ERROR_NONE)
    {
      HAL_Delay(5);
      /* Reset the HX8347I */
      status = BSP_IO_WritePin(0, IO_PIN_12, IO_PIN_RESET);
      if (status == BSP_ERROR_NONE)
      {
        HAL_Delay(5);
        /* Un-reset the HX8347I */
        status = BSP_IO_WritePin(0, IO_PIN_12, IO_PIN_SET);
        if (status == BSP_ERROR_NONE)
        {
          /* Initialize GPIO for backlight control and enable backlight */
          LCD_BACKLIGHT_GPIO_CLOCK_ENABLE();
          GPIO_InitStruct.Mode      = GPIO_MODE_OUTPUT_PP;
          GPIO_InitStruct.Pull      = GPIO_PULLUP;
          GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_MEDIUM ;
          GPIO_InitStruct.Pin       = LCD_BACKLIGHT_GPIO_PIN;
          HAL_GPIO_Init(LCD_BACKLIGHT_GPIO_PORT, &GPIO_InitStruct);
          HAL_GPIO_WritePin(LCD_BACKLIGHT_GPIO_PORT, LCD_BACKLIGHT_GPIO_PIN, GPIO_PIN_RESET);

          /* Wait 120ms according HX8347I datasheet */
          HAL_Delay(120);
        }
      }
    }
  }
#else /* USE_BSP_IO_CLASS > 0 */
  status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* USE_BSP_IO_CLASS > 0 */

  return status;
}

/**
  * @brief  Reset HX8347I and deactivate backlight.
  * @retval BSP status.
  */
static int32_t HX8347I_PowerDown(void)
{
  int32_t status;

#if (USE_BSP_IO_CLASS > 0)
  /* Deactivate backlight */
  HAL_GPIO_WritePin(LCD_BACKLIGHT_GPIO_PORT, LCD_BACKLIGHT_GPIO_PIN, GPIO_PIN_SET);

  /* Reset the HX8347I */
  status = BSP_IO_WritePin(0, IO_PIN_12, IO_PIN_RESET);
  if (status == BSP_ERROR_NONE)
  {
    /* De-initialize the BSP IO driver */
    status = BSP_IO_DeInit(0);
  }
#else /* USE_BSP_IO_CLASS > 0 */
  status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* USE_BSP_IO_CLASS > 0 */

  return status;
}

/**
  * @brief  Initialize FMC.
  * @retval BSP status.
  */
static int32_t LCD_FMC_Init(void)
{
  int32_t status = BSP_ERROR_NONE;

  hlcd_sram[0].Instance    = FMC_NORSRAM_DEVICE;
  hlcd_sram[0].Extended    = FMC_NORSRAM_EXTENDED_DEVICE;
  hlcd_sram[0].Init.NSBank = FMC_NORSRAM_BANK4;

  if (HAL_SRAM_GetState(&hlcd_sram[0]) == HAL_SRAM_STATE_RESET)
  {
#if (USE_HAL_SRAM_REGISTER_CALLBACKS == 0)
    /* Init the FMC Msp */
    FMC_MspInit(&hlcd_sram[0]);

    if (MX_FMC_BANK4_Init(&hlcd_sram[0]) != HAL_OK)
    {
      status = BSP_ERROR_BUS_FAILURE;
    }
#else
    if (Lcd_IsSramMspCbValid[0] == 0U)
    {
      if (BSP_LCD_RegisterDefaultMspCallbacks(0) != BSP_ERROR_NONE)
      {
        status = BSP_ERROR_MSP_FAILURE;
      }
    }

    if (status == BSP_ERROR_NONE)
    {
      if (MX_FMC_BANK4_Init(&hlcd_sram[0]) != HAL_OK)
      {
        status = BSP_ERROR_BUS_FAILURE;
      }
    }
#endif /* USE_HAL_SRAM_REGISTER_CALLBACKS */
  }
  return status;
}

/**
  * @brief  DeInitialize BSP FMC.
  * @retval BSP status.
  */
static int32_t LCD_FMC_DeInit(void)
{
  int32_t status = BSP_ERROR_NONE;

#if (USE_HAL_SRAM_REGISTER_CALLBACKS == 0)
  FMC_MspDeInit(&hlcd_sram[0]);
#endif /* USE_HAL_SRAM_REGISTER_CALLBACKS */

  /* De-Init the FMC */
  if (HAL_SRAM_DeInit(&hlcd_sram[0]) != HAL_OK)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }

  return status;
}

/**
  * @brief  Write 16bit values in registers of the device through BUS.
  * @param  DevAddr Device address on Bus.
  * @param  Reg     The target register start address to write.
  * @param  pData   Pointer to data buffer.
  * @param  Length  Number of data.
  * @retval BSP status.
  */
static int32_t LCD_FMC_WriteReg16(const uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint32_t Length)
{
  int32_t  ret = BSP_ERROR_NONE;
  uint32_t i = 0;

  if ((DevAddr != LCD_FMC_ADDRESS) || (pData == NULL) || (Length == 0U))
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Write register address */
    *(uint16_t *)LCD_REGISTER_ADDR = Reg;
    while (i < (2U * Length))
    {
      /* Write register value */
      *(uint16_t *)LCD_DATA_ADDR = (((uint16_t)pData[i + 1U] << 8U) & 0xFF00U) | ((uint16_t)pData[i] & 0x00FFU);
      /* Update data pointer */
      i += 2U;
    }
  }

  /* BSP status */
  return ret;
}

/**
  * @brief  Read 16bit values in registers of the device through BUS.
  * @param  DevAddr Device address on Bus.
  * @param  Reg     The target register start address to read.
  * @param  pData   Pointer to data buffer.
  * @param  Length  Number of data.
  * @retval BSP status.
  */
static int32_t LCD_FMC_ReadReg16(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint32_t Length)
{
  int32_t  ret = BSP_ERROR_NONE;
  uint32_t i = 0;
  uint16_t tmp;

  if ((DevAddr != LCD_FMC_ADDRESS) || (pData == NULL) || (Length == 0U))
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Write register address */
    *(uint16_t *)LCD_REGISTER_ADDR = Reg;
    while (i < (2U * Length))
    {
      tmp = *(uint16_t *)LCD_DATA_ADDR;
      pData[i]    = (uint8_t) tmp;
      pData[i + 1U] = (uint8_t)(tmp >> 8U);
      /* Update data pointer */
      i += 2U;
    }
  }

  /* BSP status */
  return ret;
}

/**
  * @brief  Provide a tick value in millisecond.
  * @retval Tick value.
  */
static int32_t LCD_FMC_GetTick(void)
{
  uint32_t ret;
  ret = HAL_GetTick();
  return (int32_t)ret;
}

/**
  * @brief  Initializes FMC MSP.
  * @param  hSram : SRAM handler
  * @retval None
  */
static void  FMC_MspInit(const SRAM_HandleTypeDef *hSram)
{
  GPIO_InitTypeDef  gpio_init_structure;

